package mock

import (
	"log"
	"net/http"
)

func MockTingyun() {
	// 启动一个 HTTP 服务器
	http.HandleFunc("/network-report-data/rawdata/rawdata-csv-authkey", func(w http.ResponseWriter, r *http.Request) {
		// 打印请求的 query 参数
		log.Println("Request Query:", r.URL.Query())
		// 设置响应头为 CSV 格式
		w.Header().Set("Content-Type", "text/csv")
		// 返回示例 CSV 数据
		csvData := `"时间","国家","城市运营商","监测点 IP","监测点 DNS","监测点带宽","客户端 ID","目标主机 IP","城市","运营商","等待时间(s)","缓冲前准备时间(s)","流畅度(%)","缓冲时间(s)","再缓冲时间(s)","再缓冲次数(个)","首次播放时长(s)","播放时长(s)",">页面流媒体首播时间(s)","DNS 时间(s)","SSL 握手时间(s)","首包时间(s)","TCP 连接时间(s)","内容下载时间(s)","比特率(Kbps)","码流(Kbps)","错误代码"
"2025-08-01 16:29:12","中国","杭州移动","112.10.184.67","211.140.13.188",">= 10 Mbps","8434029","183.134.26.4(衢州>移动)","杭州市","中国移动","8.41","0.408","100","0.002","0","0","299.587","299.587","0.41","0.022","0","0.107","0.008","299.771","3121.504","3100.645",""
"2025-08-01 19:29:12","中国","杭州移动","112.10.184.67","211.140.13.188",">= 10 Mbps","8434029","183.134.26.4(衢州>移动)","杭州市","中国移动","6.41","0.408","100","0.002","0","0","299.587","299.587","0.41","0.022","0","0.107","0.008","299.771","3121.504","3100.645",""
"2025-07-30 16:29:17","中国","南昌联通","171.34.196.54","220.248.192.12",">= 10 Mbps","9268824","118.212.53.78(九江联通)","南昌市","中国联通","0.419","0.418","100","0.001","0","0","299.559","299.559","0.419","0.007","0","0.103","0.021","299.742","3126.972","3101.291",""
"2025-07-30 16:29:23","中国","海口电信","223.198.5.125","202.100.192.68",">= 10 Mbps","9502991","183.60.220.71(佛山电信)","海口市","中国电信","0.612","0.612","100","0","0","0","299.387","299.387","0.612","0.14","0","0.177","0.039","299.622","3128.089","3106.123",""
`
		w.Write([]byte(csvData))
	})

	http.HandleFunc("/network-report-data/task-config/list-json-authkey", func(w http.ResponseWriter, r *http.Request) {
		// 设置响应头为 CSV 格式
		w.Header().Set("Content-Type", "text/csv")
		// 返回示例 CSV 数据
		csvData := `
{
  "status": 200,
  "data": [
    {
      "id": 3985094,
	  "name": "test1",
	  "expire": "2025-10-09 00:00:00",
	  "status": 1
	},
    {
      "id": 3985095,
	  "name": "test2",
	  "expire": "2025-08-01 15:35:00",
	  "status": 1
	}
  ]
}
`
		w.Write([]byte(csvData))
	})

	// 监听 12345 端口
	log.Println("start mock tingyun server")
	if err := http.ListenAndServe(":12345", nil); err != nil {
		// 输出错误信息
		println("启动 HTTP 服务器失败: ", err.Error())
	}
}
